GitGriever/Game/Keil_v5/ARM/Boards/Keil/MCB1500/RTX_Blinky/GLCD_SPI_LPC1500.c
/******************************************************************************/
/* GLCD_SPI_LPC1500.c: LPC1500 low level Graphic LCD (240x320 pixels) driven  */
/*                     with SPI functions                                     */
/******************************************************************************/
/* This file is part of the uVision/ARM development tools.                    */
/* Copyright (c) 2005-2013 Keil - An ARM Company. All rights reserved.        */
/* This software may only be used under the terms of a valid, current,        */
/* end user licence from KEIL for a compatible version of KEIL software       */
/* development tools. Nothing else gives you the right to use this software.  */
/******************************************************************************/


#include <LPC15xx.h>                         /* LPC15xx definitions           */
#include "GLCD.h"
#include "Font_6x8_h.h"
#include "Font_16x24_h.h"

/************************** Orientation  configuration ************************/

#define LANDSCAPE   1                   /* 1 for landscape, 0 for portrait    */
#define ROTATE180   0                   /* 1 to rotate the screen for 180 deg */

/*********************** Hardware specific configuration **********************/

/* SPI Interface: SPI1

   PINS:
   - CS     = P0.25 (GPIO pin)
   - RS     = GND
   - WR/SCK = P1.10 (SCK1)
   - RD     = GND
   - SDO    = P1.11 (MISO1)
   - SDI    = P1.9  (MOSI1)                                                    */

#define PIN_CS      (1 << 25)
#define PIN_CLK     (1 << 10)
#define PIN_DAT     (1 <<  9)

#define IN          0x00
#define OUT         0x01

/* SPI_SR - bit definitions                                                   */
#define RNE         0x01

/*------------------------- Speed dependant settings -------------------------*/

/* If processor works on high frequency delay has to be increased, it can be
   increased by factor 2^N by this constant                                   */
#define DELAY_2N    9

/*---------------------- Graphic LCD size definitions ------------------------*/

#if (LANDSCAPE == 1)
#define WIDTH       320                 /* Screen Width (in pixels)           */
#define HEIGHT      240                 /* Screen Hight (in pixels)           */
#else
#define WIDTH       240                 /* Screen Width (in pixels)           */
#define HEIGHT      320                 /* Screen Hight (in pixels)           */
#endif
#define BPP         16                  /* Bits per pixel                     */
#define BYPP        ((BPP+7)/8)         /* Bytes per pixel                    */

/*--------------- Graphic LCD interface hardware definitions -----------------*/

/* Pin CS setting to 0 or 1                                                   */
#define LCD_CS(x)   ((x) ? (LPC_GPIO_PORT->SET[0] = PIN_CS)    : (LPC_GPIO_PORT->CLR[0] = PIN_CS))
#define LCD_CLK(x)  ((x) ? (LPC_GPIO_PORT->SET[1] = PIN_CLK)   : (LPC_GPIO_PORT->CLR[1] = PIN_CLK))
#define LCD_DAT(x)  ((x) ? (LPC_GPIO_PORT->SET[1] = PIN_DAT)   : (LPC_GPIO_PORT->CLR[1] = PIN_DAT))

#define DAT_MODE(x) ((x == OUT) ? (LPC_GPIO_PORT->DIR[1] |= PIN_DAT) : (LPC_GPIO_PORT->DIR[1] &= ~PIN_DAT))
#define BUS_VAL()                ((LPC_GPIO_PORT->PIN[1]  & PIN_DAT) != 0)


#define SPI_START   (0x70)              /* Start byte for SPI transfer        */
#define SPI_RD      (0x01)              /* WR bit 1 within start              */
#define SPI_WR      (0x00)              /* WR bit 0 within start              */
#define SPI_DATA    (0x02)              /* RS bit 1 within start byte         */
#define SPI_INDEX   (0x00)              /* RS bit 0 within start byte         */

#define BG_COLOR  0                     /* Background color                   */
#define TXT_COLOR 1                     /* Text color                         */


/*---------------------------- Global variables ------------------------------*/

/******************************************************************************/
static volatile unsigned short Color[2] = {White, Black};
static unsigned char Himax;

/************************ Local auxiliary functions ***************************/

/*******************************************************************************
* Delay in while loop cycles                                                   *
*   Parameter:    cnt:    number of while cycles to delay                      *
*   Return:                                                                    *
*******************************************************************************/

static void delay (int cnt) {
  cnt <<= DELAY_2N;
  while (cnt--);
}


/*******************************************************************************
* Transfer 1 byte over the serial communication                                *
*   Parameter:    byte:   byte to be sent                                      *
*                 mode:   OUT = transmit byte, IN = receive byte               *
*   Return:               byte read while sending                              *
*******************************************************************************/
static unsigned char spi_tran_man (unsigned char byte, unsigned int mode) {
  unsigned char val = 0;
  int i;

  if (mode == OUT) { DAT_MODE (OUT); }
  else             { DAT_MODE (IN);  }

  for (i = 7; i >= 0; i--) {
    LCD_CLK(0);
    delay(1);
    if (mode == OUT) {
      LCD_DAT((byte & (1 << i)) != 0);
    }
    else {
      val |= (BUS_VAL() << i);
    }
    LCD_CLK(1);
    delay(1);
  }
  return (val);
}


/*******************************************************************************
* Transfer 1 byte over the serial communication                                *
*   Parameter:    byte:   byte to be sent                                      *
*   Return:               byte read while sending                              *
*******************************************************************************/

static __inline unsigned char spi_tran (unsigned char byte) {

  LPC_SPI1->TXDAT = byte;
  while (!(LPC_SPI1->STAT & RNE));        /* Wait for send to finish            */
  return (LPC_SPI1->RXDAT);
}


